IDEA Open Model
ConcreteULSCheckResultShearEc2 Class
Compatible with IDEA StatiCa 20.1
 ULS Check Shear Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShear
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteULSCheckResultShearEc2 : ConcreteULSCheckResultShear
Public Class ConcreteULSCheckResultShearEc2
	Inherits ConcreteULSCheckResultShear
The ConcreteULSCheckResultShearEc2 type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultShearEc2
Initializes a new instance of the ConcreteULSCheckResultShearEc2 class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Ved
 shear force
Vrd
 decisive shear resistance
Vrdc
 shear resistance of concrete
Vrdmax
 shear resistance of compression strut
Vrdr
 shear resistance
Vrds
 shear resistance of shear reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace